In [20]:
import pandas as pd
import sqlite3 as sql
import os

In [21]:
# Loading the Dataset

df = pd.read_csv('netflix_titles.csv')
df.shape

(8807, 12)

In [22]:
# Making some simple cleanning operations over the data

df.drop(columns=['show_id'], inplace=True)
df.dropna(how='any', axis=0, inplace=True)
df.rename(columns={'listed_in':'genre'},inplace=True)
df.reset_index(drop=True, inplace=True)
df.shape

(5332, 11)

In [23]:
# Converting all attributes with multiple values (as a string) into a list

attributes = ['director', 'cast', 'country', 'genre']
for i in attributes:
    df[i] = df[i].str.split(", ")

In [24]:
# Dropping incorrect rows

row  = 0
for lista_country in df['country']:
    if ('' in lista_country):
        df.drop(row, inplace=True)
    row += 1
df.reset_index(drop=True, inplace=True)
df.head(3)

,type,title,director,cast,country,date_added,release_year,rating,duration,genre,description
0,Movie,Sankofa,[Haile Gerima],"[Kofi Ghanaba, Oyafunmike Ogunlano, Alexandra ...","[United States, Ghana, Burkina Faso, United Ki...","September 24, 2021",1993,TV-MA,125 min,"[Dramas, Independent Movies, International Mov...","On a photo shoot in Ghana, an American model s..."
1,TV Show,The Great British Baking Show,[Andy Devonshire],"[Mel Giedroyc, Sue Perkins, Mary Berry, Paul H...",[United Kingdom],"September 24, 2021",2021,TV-14,9 Seasons,"[British TV Shows, Reality TV]",A talented batch of amateur bakers face off in...
2,Movie,The Starling,[Theodore Melfi],"[Melissa McCarthy, Chris O'Dowd, Kevin Kline, ...",[United States],"September 24, 2021",2021,PG-13,104 min,"[Comedies, Dramas]",A woman adjusting to life after a loss contend...

---

<span style="font-family: TimesNewRoman;font-weight:20;font-size:30px">
<center><b>Dados da Tabela <i>Type</i></b></center>
</span>
<p></p>

In [25]:
# Organizing the data destined to the Type Table

list_types = sorted(df['type'].unique())

type_converter = {}

for i in range(len(list_types)):
    type_converter.update({list_types[i]:i})

dict_types = {'type':list_types}
Type_Table = pd.DataFrame(dict_types)
Type_Table.index.name = 'type_id'
Type_Table.to_csv('Output_Tables/Type_Table.csv', sep=',')
Type_Table

            type
type_id
0          Movie
1        TV Show

---

<span style="font-family: TimesNewRoman;font-weight:20;font-size:30px">
<center><b>Dados da Tabela <i>Job</i></b></center>
</span>
<p></p>

In [26]:
job_list = ['cast', 'director']
job_dict = {'name':job_list}

job_converter = {'cast':0, 'director':1}

Job_Table = pd.DataFrame(job_dict)
Job_Table.index.name='job_id'
Job_Table.to_csv('Output_Tables/Job_Table.csv', sep=',')
Job_Table

            name
job_id
0           cast
1       director

---

<span style="font-family: TimesNewRoman;font-weight:20;font-size:30px">
<center><b>Dados da Tabela <i>Rating</i></b></center>
</span>
<p></p>

In [27]:
# Organizing the data destined to the Rating Table

list_ratings = sorted(df['rating'].unique())

rating_converter = {}

for i in range(len(list_ratings)):
    rating_converter.update({list_ratings[i]:i})

# Acronym description added
dict_discription = {'G':'General Audiences',
                   'NC-17':'No children under 17',
                   'NR':'Not Rated',
                   'PG':'Parental Guidance Suggested',
                   'PG-13':'Parents Strongly Cautioned, Some Material May be Inappropriate for Children Under 13',
                   'R':'Restricted [Requires accompanying parent or adult guardian]',
                   'TV-14':'This program contains material that most parents would find unsuitable for children under 14',
                   'TV-G':'General Audience',
                   'TV-MA':'Mature Audience Only',
                   'TV-PG':'Parental Guidance Suggested',
                   'TV-Y':'Appropriate for All Ages',
                   'TV-Y7':'Most Appropriate for Children age 7 and Up',
                   'TV-Y7-FV':'Contains <fantasy violence> that may be intense or combative than other TV-Y7 programs',
                   'UR':'Unrated'}

list_discriptions = []
for rating in list_ratings:
    list_discriptions.append(dict_discription[rating])
    
dict_rating = {'acronym':list_ratings, 'description':list_discriptions}
Rating_Table = pd.DataFrame(dict_rating)
Rating_Table.index.name = 'rating_id'
Rating_Table.to_csv('Output_Tables/Rating_Table.csv', sep=',')
Rating_Table.head(10)

          acronym                                        description
rating_id
0               G                                  General Audiences
1           NC-17                               No children under 17
2              NR                                          Not Rated
3              PG                        Parental Guidance Suggested
4           PG-13  Parents Strongly Cautioned, Some Material May ...
5               R  Restricted [Requires accompanying parent or ad...
6           TV-14  This program contains material that most paren...
7            TV-G                                   General Audience
8           TV-MA                               Mature Audience Only
9           TV-PG                        Parental Guidance Suggested

---

<span style="font-family: TimesNewRoman;font-weight:20;font-size:30px">
<center><b>Dados da Tabela <i>Genre</i></b></center>
</span>
<p></p>

In [28]:
# Organizing the data destined to the Genre Table

list_genre = sorted(df['genre'].sum())
new_list_genre = []
genre_converter = {}
idx = 0

for genre in list_genre:
    if (genre not in new_list_genre):
        new_list_genre.append(genre)
        genre_converter.update({genre:idx})
        idx += 1

dict_genre = {'name':new_list_genre}

Genre_Table = pd.DataFrame(dict_genre)
Genre_Table.index.name = 'genre_id'
Genre_Table.to_csv('Output_Tables/Genre_Table.csv', sep=',')
Genre_Table.head(10)

                              name
genre_id
0               Action & Adventure
1                   Anime Features
2                     Anime Series
3                 British TV Shows
4         Children & Family Movies
5                Classic & Cult TV
6                   Classic Movies
7                         Comedies
8                   Crime TV Shows
9                      Cult Movies

---

<span style="font-family: TimesNewRoman;font-weight:20;font-size:30px">
<center><b>Dados da Tabela <i>Country</i></b></center>
</span>
<p></p>

In [29]:
# Organizing the data destined to the Country Table

df['country'] = df['country'].apply(lambda x: [country_name.replace(',', '') for country_name in x])
list_countries = sorted(df['country'].sum())
new_list_countries = []
country_converter = {}
idx = 0

for country in list_countries:
    if (country not in new_list_countries):
        new_list_countries.append(country)
        country_converter.update({country:idx})
        idx += 1
    
dict_countries = {'name':new_list_countries}

Country_Table = pd.DataFrame(dict_countries)
Country_Table.index.name = 'country_id'
Country_Table.to_csv('Output_Tables/Country_Table.csv', sep=',')
Country_Table.head(5)

                   name
country_id
0           Afghanistan
1               Albania
2               Algeria
3                Angola
4             Argentina

---

<span style="font-family: TimesNewRoman;font-weight:20;font-size:30px">
<center><b>Dados da Tabela <i>Person</i></b></center>
</span>
<p></p>

In [30]:
# Organizing the data destined to the Person Table

df_people = pd.DataFrame(columns=['people'])

df_people['people'] = df['director'] + df['cast']
people_list = sorted(df_people['people'].sum())
new_people_list = [] # To store all unique values
people_converter = {}
idx = 0

for person in people_list:
    if (person not in new_people_list):
        people_converter.update({person:idx})
        new_people_list.append(person)
        idx += 1

Person_Table = pd.DataFrame(columns=["person_id", "name"])

for key in people_converter:
    Person_Table.loc[len(Person_Table)] = [people_converter[key], key]
    
Person_Table.set_index('person_id', inplace=True)
Person_Table.to_csv('Output_Tables/Person_Table.csv', sep=',')
Person_Table.head(5)

                            name
person_id
0                            Jr.
1          "Riley" Lakdhar Dridi
2                   'Najite Dede
3                           2Mex
4                        50 Cent

---

<span style="font-family: TimesNewRoman;font-weight:20;font-size:30px">
<center><b>Dados da Tabela <i>Show_Genre</i></b></center>
</span>
<p></p>

In [31]:
Show_Genre_Table = pd.DataFrame(columns=["show_id", "genre_id"])

for show_id in range (df.shape[0]):
    list_genre = df.loc[show_id]['genre']
    for genre in list_genre:
        Show_Genre_Table.loc[len(Show_Genre_Table)] = [show_id, genre_converter[genre]]

Show_Genre_Table.set_index('show_id', inplace=True)
Show_Genre_Table.to_csv('Output_Tables/Show_Genre_Table.csv', sep=',')

# Eliminação da Coluna 'genre'

df.drop(columns=['genre'], inplace=True)

Show_Genre_Table.head(5)

         genre_id
show_id
0              12
0              15
0              16
1               3
1              23

---

<span style="font-family: TimesNewRoman;font-weight:20;font-size:30px">
    <center><b>Dados da Tabela <i>Show_Country</i> </b></center>
</span>
<p></p>

In [32]:
Show_Country_Table = pd.DataFrame(columns=["show_id", "country_id"])

for show_id in range (df.shape[0]):
    list_country = df.loc[show_id]['country']
    for country in list_country:
        Show_Country_Table.loc[len(Show_Country_Table)] = [show_id, country_converter[country]]

Show_Country_Table.set_index('show_id', inplace=True)
Show_Country_Table.to_csv('Output_Tables/Show_Country_Table.csv', sep=',')

# Eliminação da Coluna 'country'

df.drop(columns=['country'], inplace=True)

Show_Country_Table.head(5)

         country_id
show_id
0               102
0                33
0                13
0               101
0                32

---

<span style="font-family: TimesNewRoman;font-weight:20;font-size:30px">
    <center><b>Dados da Tabela <i>Show_Person_Job</i></b></center>
</span>
<p></p>

In [33]:
Show_Person_Job_Table = pd.DataFrame(columns=['show_id','person_id', 'job_id'])

for show_id in range (df.shape[0]):
    list_cast = df.loc[show_id]['cast']
    list_directors = df.loc[show_id]['director']
    
    for actor in list_cast:
        Show_Person_Job_Table.loc[len(Show_Person_Job_Table)] = [show_id, people_converter[actor], 0]
    
    for director in list_directors:
        Show_Person_Job_Table.loc[len(Show_Person_Job_Table)] = [show_id, people_converter[director], 1]


Show_Person_Job_Table.drop_duplicates(keep='first', inplace=True)
Show_Person_Job_Table.set_index('show_id', inplace=True)
Show_Person_Job_Table.to_csv('Output_Tables/Show_Person_Job_Table.csv', sep=',')

# Eliminação das Colunas 'director' e 'cast'

df.drop(columns=['director', 'cast'], inplace=True)

Show_Person_Job_Table.head(5)

         person_id  job_id
show_id
0            14934       0
0            20546       0
0             1032       0
0            19823       0
0            19186       0

---

<span style="font-family: TimesNewRoman;font-weight:20;font-size:30px">
<center><b>Dados da Tabela <i>Show</i></b></center>
</span>
<p></p>

In [34]:
# Simplificação de Colunas

df['rating'] = df['rating'].apply(lambda x: rating_converter[x])
df['type'] = df['type'].apply(lambda x: type_converter[x])

# Renomeação de Colunas

df.rename(columns={'rating':'rating_id',
                   'type':'type_id'}, inplace=True)

# No fim de contas o df final vai corresponder à tabela principal: 'Show'

df.index.name = 'show_id'
df.to_csv('Output_Tables/Show_Table.csv', sep=',')
Show_Table = df
Show_Table.head(5)

,type_id,title,date_added,release_year,rating_id,duration,description
show_id,,,,,,,
0,0,Sankofa,"September 24, 2021",1993,8,125 min,"On a photo shoot in Ghana, an American model s..."
1,1,The Great British Baking Show,"September 24, 2021",2021,6,9 Seasons,A talented batch of amateur bakers face off in...
2,0,The Starling,"September 24, 2021",2021,4,104 min,A woman adjusting to life after a loss contend...
3,0,Je Suis Karl,"September 23, 2021",2021,8,127 min,After most of her family is murdered in a terr...
4,0,Jeans,"September 21, 2021",1998,6,166 min,When the father of the man she loves insists t...

---

<span style="font-family: TimesNewRoman;font-weight:20;font-size:30px">
<center><b>Criação das Tabelas e Inserção dos Dados</b></center>
</span>
<p></p>

In [35]:
# Criação da Base de Dados

DATABASE_NAME = 'Netflix.db'

# Se o Ficheiro da Base de Dados existir, é eliminado (visto poder ser uma versão antiga)
if os.path.isfile(DATABASE_NAME):
    os.remove(DATABASE_NAME)

# Criar a Conexão (Como o ficheiro deixou de existir, é criado um novo)
conn = sql.connect(DATABASE_NAME)
cur = conn.cursor()

In [36]:
# Creating Type table

Type_Table_Query = '''CREATE TABLE IF NOT EXISTS Type (
                      type_id INT,
                      type CHAR(25),
                      PRIMARY KEY (type_id)
                      ); '''

cur.execute(Type_Table_Query)

n_types = Type_Table.to_sql(name='Type', con=conn, if_exists='append')
print(f'Foram Adicionados {n_types} Tipos com Sucesso!')

Foram Adicionados 2 Tipos com Sucesso!

In [37]:
# Creating Job table

Job_Table_Query = '''CREATE TABLE IF NOT EXISTS Job (
                      job_id INT,
                      name CHAR(25),
                      PRIMARY KEY (job_id)
                      ); '''

cur.execute(Job_Table_Query)

n_jobs = Job_Table.to_sql(name='Job', con=conn, if_exists='append')
print(f'Foram Adicionados {n_jobs} Trabalhos/Profissões com Sucesso!')

Foram Adicionados 2 Trabalhos/Profissões com Sucesso!

In [38]:
# Creating Rating table

Rating_Table_Query = '''CREATE TABLE IF NOT EXISTS Rating (
                        rating_id INT,
                        acronym CHAR(25),
                        description CHAR(60),
                        PRIMARY KEY (rating_id)
                        ); '''

cur.execute(Rating_Table_Query)

n_ratings = Rating_Table.to_sql(name='Rating', con=conn, if_exists='append')
print(f'Foram Adicionados {n_ratings} Rating\'s com Sucesso!')

Foram Adicionados 14 Rating's com Sucesso!

In [39]:
# Creating Genre table

Genre_Table_Query = '''CREATE TABLE IF NOT EXISTS Genre (
                       genre_id INT,
                       name CHAR(30),
                       PRIMARY KEY (genre_id)
                       ); '''

cur.execute(Genre_Table_Query)

n_genres = Genre_Table.to_sql(name='Genre', con=conn, if_exists='append')
print(f'Foram Adicionados {n_genres} Géneros com Sucesso!')

Foram Adicionados 42 Géneros com Sucesso!

In [40]:
# Creating Country table

Country_Table_Query = '''CREATE TABLE IF NOT EXISTS Country (
                         country_id INT,
                         name CHAR(30),
                         PRIMARY KEY (country_id)
                         ); '''

cur.execute(Country_Table_Query)

n_countries = Country_Table.to_sql(name='Country', con=conn, if_exists='append')
print(f'Foram Adicionados {n_countries} Países com Sucesso!')

Foram Adicionados 109 Países com Sucesso!

In [41]:
# Creating Person table

Person_Table_Query = '''CREATE TABLE IF NOT EXISTS Person (
                        person_id INT,
                        name CHAR(30),
                        PRIMARY KEY (person_id)
                        ); '''

cur.execute(Person_Table_Query)

n_persons = Person_Table.to_sql(name='Person', con=conn, if_exists='append')
print(f'Foram Adicionados {n_persons} Pessoas com Sucesso!')

Foram Adicionados 29337 Pessoas com Sucesso!

In [42]:
# Creating Show table

Show_Table_Query = '''CREATE TABLE IF NOT EXISTS Show (
                      show_id INT,
                      type_id INT,
                      rating_id INT,
                      title CHAR(20),
                      date_added DATE,
                      release_year INT,
                      duration CHAR(20),
                      description CHAR(60),
                      PRIMARY KEY (show_id),
                      FOREIGN KEY (type_id) REFERENCES Type(type_id),
                      FOREIGN KEY (rating_id) REFERENCES Rating(rating_id)
                      ); '''

cur.execute(Show_Table_Query)

n_shows = Show_Table.to_sql(name='Show', con=conn, if_exists='append')
print(f'Foram Adicionados {n_shows} Shows com Sucesso!')

Foram Adicionados 5331 Shows com Sucesso!

In [43]:
# Creating Show_Genre table

Show_Genre_Table_Query = '''CREATE TABLE IF NOT EXISTS Show_Genre (
                            show_id INT,
                            genre_id INT,
                            PRIMARY KEY (show_id, genre_id),
                            FOREIGN KEY (show_id) REFERENCES Show(show_id),
                            FOREIGN KEY (genre_id) REFERENCES Genre(genre_id)
                            ); '''

cur.execute(Show_Genre_Table_Query)

Show_Genre_Table.to_sql(name='Show_Genre', con=conn, if_exists='append')
;

''

In [44]:
# Creating Show_Country table

Show_Country_Table_Query = '''CREATE TABLE IF NOT EXISTS Show_Country (
                              show_id INT,
                              country_id INT,
                              PRIMARY KEY (show_id, country_id),
                              FOREIGN KEY (show_id) REFERENCES Show(show_id),
                              FOREIGN KEY (country_id) REFERENCES Country(country_id)
                              ); '''

cur.execute(Show_Country_Table_Query)

Show_Country_Table.to_sql(name='Show_Country', con=conn, if_exists='append')
;

''

In [45]:
# Creating Show_Person_Job table

Show_Person_Job_Table_Query = '''CREATE TABLE IF NOT EXISTS Show_Person_Job (
                              show_id INT,
                              person_id INT,
                              job_id INT,
                              PRIMARY KEY (show_id, person_id, job_id),
                              FOREIGN KEY (show_id) REFERENCES Show(show_id),
                              FOREIGN KEY (person_id) REFERENCES Person(person_id),
                              FOREIGN KEY (job_id) REFERENCES Job(job_id)
                              ); '''

cur.execute(Show_Person_Job_Table_Query)

Show_Person_Job_Table.to_sql(name='Show_Person_Job', con=conn, if_exists='append')
;

''

In [46]:
# Fechar a Conexão à Base de Dados

conn.close()

---